Introduction:
- Pandas is the popular library in Python. It is extensively used to read data and process data.
- data comes in rows and columns
- it has bunch of functions

Pandas ObjectSs:
- DataFrame
- Series

DataFrame:

- it is a main object in Pandas. It is used to represent data with rows and columns.
- it is a data structure represent the data in tabular or excel spread sheet like data.

Creating DataFrame:

In [17]:
import pandas as pd

In [18]:
df = pd.read_csv('data/nyc_weather.csv')
df

,date,tmax,tmin,tavg,departure,HDD,CDD,precipitation,new_snow,snow_depth
0,1/1/19,60,40,50.0,13.9,15,0,0.08,0,0
1,2/1/19,41,35,38.0,2.1,27,0,0,0,0
2,3/1/19,45,39,42.0,6.3,23,0,T,0,0
3,4/1/19,47,37,42.0,6.5,23,0,0,0,0
4,5/1/19,47,42,44.5,9.1,20,0,0.45,0,0
...,...,...,...,...,...,...,...,...,...,...
360,27/12/19,54,42,48.0,10.8,17,0,T,0,0
361,28/12/19,50,44,47.0,10.0,18,0,0,0,0
362,29/12/19,44,38,41.0,4.3,24,0,0.29,0,0
363,30/12/19,43,38,40.5,4.0,24,0,0.49,0,0
364,31/12/19,46,38,42.0,5.7,23,0,0.01,0,0

In [19]:
df.tail()

,date,tmax,tmin,tavg,departure,HDD,CDD,precipitation,new_snow,snow_depth
360,27/12/19,54,42,48.0,10.8,17,0,T,0,0
361,28/12/19,50,44,47.0,10.0,18,0,0,0,0
362,29/12/19,44,38,41.0,4.3,24,0,0.29,0,0
363,30/12/19,43,38,40.5,4.0,24,0,0.49,0,0
364,31/12/19,46,38,42.0,5.7,23,0,0.01,0,0

In [20]:
df.shape

(365, 10)

In [21]:
df.columns

Index(['date', 'tmax', 'tmin', 'tavg', 'departure', 'HDD', 'CDD',
       'precipitation', 'new_snow', 'snow_depth'],
      dtype='object')

In [22]:
df.tmax #print particular column data

0      60
1      41
2      45
3      47
4      47
       ..
360    54
361    50
362    44
363    43
364    46
Name: tmax, Length: 365, dtype: int64

In [23]:
#another way of accessing column 
df['tmax'] # df.tmax (both are same)

0      60
1      41
2      45
3      47
4      47
       ..
360    54
361    50
362    44
363    43
364    46
Name: tmax, Length: 365, dtype: int64

In [24]:
df['tmax'].describe()

count    365.000000
mean      63.169863
std       18.806232
min       16.000000
25%       47.000000
50%       63.000000
75%       79.000000
max      100.000000
Name: tmax, dtype: float64

In [25]:
# select rows which has maximum temperature [row with max. temperature]
df[df.tmax == df.tmax.max()]

,date,tmax,tmin,tavg,departure,HDD,CDD,precipitation,new_snow,snow_depth
201,21/7/19,100,83,91.5,11.9,0,27,0.01,0,0

In [26]:
# select only date column which has maximum temperature
df.date[df.tmax == df.tmax.max()]

201    21/7/19
Name: date, dtype: object

Read and Write csv and xls files

In [27]:
# to read xls files, first,  pip install xlrd 
# read excel file:
#df = pd.read_excel('excel_name')
#df

In [28]:
'''to store file is excel:
- pip install openpyxl
- write df to excel:
- df.to_excel('new.xlsx', sheet_name='new_excel_name')
'''

"to store file is excel:\n- pip install openpyxl\n- write df to excel:\n- df.to_excel('new.xlsx', sheet_name='new_excel_name')\n"

In [29]:
'''
write df to csv:
- df.to_csv('new.csv')
- df.to_csv('new_noIndex.csv', index=False) '''

"\nwrite df to csv:\n- df.to_csv('new.csv')\n- df.to_csv('new_noIndex.csv', index=False) "

Group-by

In [30]:
df = pd.read_csv('data/weather.csv')
df

         day       city  temperature  windspeed   event
0   1/1/2017   new york           32          6    Rain
1   1/2/2017   new york           36          7   Sunny
2   1/3/2017   new york           28         12    Snow
3   1/4/2017   new york           33          7   Sunny
4   1/1/2017  kathmandu           66         11   Sunny
5   1/2/2017  kathmandu           65          4     Fog
6   1/3/2017  kathmandu           70          8     Fog
7   1/4/2017  kathmandu           80          6    Rain
8   1/1/2017      paris           45         13  Cloudy
9   1/2/2017      paris           50          8  Cloudy
10  1/3/2017      paris           42         10  Cloudy

In [31]:
g = df.groupby('city')
g

In [32]:
for city, city_df in g:
    print(city)
    print(city_df)

kathmandu
        day       city  temperature  windspeed  event
4  1/1/2017  kathmandu           66         11  Sunny
5  1/2/2017  kathmandu           65          4    Fog
6  1/3/2017  kathmandu           70          8    Fog
7  1/4/2017  kathmandu           80          6   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         13  Cloudy
9   1/2/2017  paris           50          8  Cloudy
10  1/3/2017  paris           42         10  Cloudy

In [33]:
# to get specific group
g.get_group('kathmandu')

        day       city  temperature  windspeed  event
4  1/1/2017  kathmandu           66         11  Sunny
5  1/2/2017  kathmandu           65          4    Fog
6  1/3/2017  kathmandu           70          8    Fog
7  1/4/2017  kathmandu           80          6   Rain

In [34]:
# find maximum temperature in each of the cities
print(g.max())

                day  temperature  windspeed   event
city
kathmandu  1/4/2017           80         11   Sunny
new york   1/4/2017           36         12   Sunny
paris      1/3/2017           50         13  Cloudy

In [35]:
print(g.mean())

           temperature  windspeed
city
kathmandu    70.250000   7.250000
new york     32.250000   8.000000
paris        45.666667  10.333333

C:\Users\rmans\AppData\Local\Temp\ipykernel_11468\1908229540.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(g.mean())

In [36]:
print(g.describe()) # gives only numeric values. Here not printed cities and events

          temperature                                                       \
                count       mean       std   min    25%   50%    75%   max
city
kathmandu         4.0  70.250000  6.849574  65.0  65.75  68.0  72.50  80.0
new york          4.0  32.250000  3.304038  28.0  31.00  32.5  33.75  36.0
paris             3.0  45.666667  4.041452  42.0  43.50  45.0  47.50  50.0

          windspeed
              count       mean       std  min   25%   50%    75%   max
city
kathmandu       4.0   7.250000  2.986079  4.0  5.50   7.0   8.75  11.0
new york        4.0   8.000000  2.708013  6.0  6.75   7.0   8.25  12.0
paris           3.0  10.333333  2.516611  8.0  9.00  10.0  11.50  13.0

Concatenate DataFrames

In [38]:
# creating new dataframe using dictionary

nepal_weather = pd.DataFrame({
    "city" : ["pokhara", "chitwan", "Iilam"],
    "temperature" : [32, 35, 26],
    "humidity" : [60, 70, 40]
})

nepal_weather

      city  temperature  humidity
0  pokhara           32        60
1  chitwan           35        70
2    Iilam           26        40

In [39]:
japan_weather = pd.DataFrame({
    "city" : ["Hirosima", "tokyo", "Nagasaki"],
    "temperature" : [21, 15, 26],
    "humidity" : [63, 50, 44]
})

japan_weather

       city  temperature  humidity
0  Hirosima           21        63
1     tokyo           15        50
2  Nagasaki           26        44

In [40]:
# concate two dataframes

df = pd.concat([nepal_weather, japan_weather])
df

       city  temperature  humidity
0   pokhara           32        60
1   chitwan           35        70
2     Iilam           26        40
0  Hirosima           21        63
1     tokyo           15        50
2  Nagasaki           26        44

In [41]:
#continuous index
df = pd.concat([nepal_weather, japan_weather], ignore_index= True)
df

       city  temperature  humidity
0   pokhara           32        60
1   chitwan           35        70
2     Iilam           26        40
3  Hirosima           21        63
4     tokyo           15        50
5  Nagasaki           26        44

In [42]:
# column wise dataframe

df = pd.concat([nepal_weather, japan_weather], axis=1)
df

      city  temperature  humidity      city  temperature  humidity
0  pokhara           32        60  Hirosima           21        63
1  chitwan           35        70     tokyo           15        50
2    Iilam           26        40  Nagasaki           26        44

Merge DataFrame

In [43]:
temperature_df = pd.DataFrame({
    "city" : ["kathmandu", "pokhara", "chitwan"],
    "temperature" : [25, 30, 35]
})

temperature_df

        city  temperature
0  kathmandu           25
1    pokhara           30
2    chitwan           35

In [47]:
humidity_df = pd.DataFrame({
    "city" : ["kathmandu", "birgunj", "chitwan"],
    "humidity" : [40, 50, 44]
})

humidity_df

        city  humidity
0  kathmandu        40
1    birgunj        50
2    chitwan        44

In [48]:
# merge two dataframes with out explicitly mention index

df = pd.merge(temperature_df, humidity_df, on='city')
df

        city  temperature  humidity
0  kathmandu           25        40
1    chitwan           35        44

In [49]:
#outer join
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature  humidity
0  kathmandu         25.0      40.0
1    pokhara         30.0       NaN
2    chitwan         35.0      44.0
3    birgunj          NaN      50.0

In [ ]:
'''
Numerical Indexing: 
.loc --> index
.iloc --> row number
'''